In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5',],columns=['Column1','Column2','Column3','Column4'])
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [5]:
type(df.loc['Row1'])
# The datatype is series because the number of rows is = 1

pandas.core.series.Series

In [6]:
type(df['Column1'])
# The datatype is series because the number of columns is = 1

pandas.core.series.Series

In [7]:
df.loc[['Row1','Row2']]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [8]:
type(df.loc[['Row1','Row2']])

pandas.core.frame.DataFrame

In [9]:
df.iloc[:,1:2]

      Column2
Row1        1
Row2        5
Row3        9
Row4       13
Row5       17

In [10]:
df.iloc[1:,:]

      Column1  Column2  Column3  Column4
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [12]:
# This is probably useful for computation as the ndarrays will be faster than the data frames.
type(df.values)

numpy.ndarray

In [13]:
df.Column1.isnull()

Row1    False
Row2    False
Row3    False
Row4    False
Row5    False
Name: Column1, dtype: bool

In [14]:
df.isnull()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [15]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [16]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [17]:
df=pd.read_csv('./data/mercedesbenz.csv')

In [18]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [19]:
# General summary of the data frame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [21]:
# SUmmaries of the numerical columns
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [22]:
# value counts
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [24]:
df.shape

(4209, 378)

In [25]:
df[df['y']>100].shape

(2004, 378)

In [26]:
df['X11'].value_counts()

0    4209
Name: X11, dtype: int64

In [27]:
lst_data=[[1,2,3],[3,4,np.nan],[5,6,np.nan],[np.nan,np.nan,np.nan]]

In [29]:
df = pd.DataFrame(lst_data)

In [30]:
df.head()

     0    1    2
0  1.0  2.0  3.0
1  3.0  4.0  NaN
2  5.0  6.0  NaN
3  NaN  NaN  NaN

In [31]:
df.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [32]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [33]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],
                     columns=['one', 'two', 'three'])

In [34]:
df

        one       two     three
a  0.010751  0.075919  0.023471
c  0.340012 -1.496089 -0.266147
e -0.568872 -1.210428  0.943604
f -1.248020 -0.498002 -0.298729
h -0.346866  0.799897  0.118868

In [35]:
df.head()

        one       two     three
a  0.010751  0.075919  0.023471
c  0.340012 -1.496089 -0.266147
e -0.568872 -1.210428  0.943604
f -1.248020 -0.498002 -0.298729
h -0.346866  0.799897  0.118868

In [36]:
df2=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [37]:
df2

        one       two     three
a  0.010751  0.075919  0.023471
b       NaN       NaN       NaN
c  0.340012 -1.496089 -0.266147
d       NaN       NaN       NaN
e -0.568872 -1.210428  0.943604
f -1.248020 -0.498002 -0.298729
g       NaN       NaN       NaN
h -0.346866  0.799897  0.118868

In [38]:
df2.dropna(axis=0)

        one       two     three
a  0.010751  0.075919  0.023471
c  0.340012 -1.496089 -0.266147
e -0.568872 -1.210428  0.943604
f -1.248020 -0.498002 -0.298729
h -0.346866  0.799897  0.118868

In [39]:
pd.isna(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [40]:
df2['one'].notna()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [41]:
df2.fillna('Missing')

        one       two     three
a  0.010751  0.075919  0.023471
b   Missing   Missing   Missing
c  0.340012 -1.496089 -0.266147
d   Missing   Missing   Missing
e -0.568872 -1.210428  0.943604
f  -1.24802 -0.498002 -0.298729
g   Missing   Missing   Missing
h -0.346866  0.799897  0.118868

In [42]:
df2['one'].values

array([ 0.01075115,         nan,  0.3400121 ,         nan, -0.56887186,
       -1.24801982,         nan, -0.34686649])

### CSV

In [43]:
from io import StringIO, BytesIO

In [44]:
data = ('col1,col2,col3\n'
            'x,y,1\n'
            'a,b,2\n'
            'c,d,3')

In [45]:
data

'col1,col2,col3\nx,y,1\na,b,2\nc,d,3'

In [46]:
type(data)

str

In [47]:
type(StringIO(data))

_io.StringIO

In [48]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [50]:
StringIO(data)

In [51]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [74]:
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11,12')

In [75]:
data

'a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11,12'

In [76]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [77]:
df=pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [78]:
df['a'][1]

'5'

In [79]:
df.dtypes

a    object
b    object
c    object
d    object
dtype: object

In [80]:
df=pd.read_csv(StringIO(data),dtype=object)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [81]:
df=pd.read_csv(StringIO(data),dtype=int)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [82]:
df=pd.read_csv(StringIO(data),dtype=float)
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [83]:
df=pd.read_csv(StringIO(data),dtype=float,index_col=False)
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [84]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
               '8,orange,crow,10')

In [86]:
df=pd.read_csv(StringIO(data),index_col=3)
df

      index       a     b
c
5.7       4   apple   bat
10.0      8  orange  crow

In [87]:
df=pd.read_csv(StringIO(data))
df

   index       a     b     c
0      4   apple   bat   5.7
1      8  orange  crow  10.0

In [88]:
df=pd.read_csv(StringIO(data),index_col=0)
df

            a     b     c
index
4       apple   bat   5.7
8      orange  crow  10.0

In [91]:
df=pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)
df

      b     c
0   bat   5.7
1  crow  10.0